Revit 2026 API

# BuiltInFailuresSkylightFailures Class

---

Failures about Skylight.

SystemObject Autodesk.Revit.DBBuiltInFailuresSkylightFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SkylightFailures
```
```vb
Public NotInheritable Class SkylightFailures
```
```cpp
public ref class SkylightFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SkylightFailures = class end
```

The BuiltInFailuresSkylightFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MinSkylightWidthImperial | The minimum skylight width is 8 inches. |
|  | MinSkylightWidthMetric | The minimum skylight width is 203.2 millimeters. |

#### Reference

Autodesk.Revit.DB Namespace